import React from "react";
import SocialImg from "../../assets/images/social-networks-marketing-2.png.png";

const ContentSection: React.FC = () => {
  return (
    <section className="flex flex-col justify-center px-[10px] w-full text-base leading-loose text-right min-h-[490px] text-neutral-700 max-md:px-5 max-md:max-w-full">
      <div className="flex flex-col flex-1 max-w-[1140px] gap-[20px] my-0 mx-auto py-[10px] w-full">
        <div>
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl">
              פרסום ברשתות החברתיות
            </h2>
          </div>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <div>
              <ul
                className=" list-disc"
                style={{ padding: "revert", margin: "revert" }}
              >
                <li>
                  <p>
                    החשיפה האורגנית ברשתות חברתיות יורדת בהתמדה, ככל שיותר
                    מותגים ועסקים מציפים את הפלטפורמות.
                  </p>
                </li>
                <li>
                  <p>
                    קידום ממומן הופך הכרחי עבור רוב העסקים כיום כדי ליצור חשיפה
                    ומודעות.
                  </p>
                </li>
                <li>
                  <p>
                    לפני תחילת קמפיינים ממומנים, חיוני לבנות אסטרטגיה דיגיטלית
                    כוללת עם יעדים ומטרות ברורים.
                  </p>
                </li>
                <li>
                  <p>
                    האסטרטגיה צריכה לכלול גם פעילות אורגנית בנוסף לממומן – תוכן,
                    קהילה, שיתופי פעולה.
                  </p>
                </li>
                <li>
                  <p>
                    יש לבחור את הפלטפורמות והערוצים המתאימים ביותר למותג ולקהל
                    היעד.
                  </p>
                </li>
                <li>
                  <p>
                    ניתוח נתונים שוטף ואופטימיזציה הם חיוניים כדי לשפר תוצאות
                    ולהגדיל ROI.
                  </p>
                </li>
                <li>
                  <p>
                    איזון נכון בין פעילות אורגנית לממומנת ושילוב ערוצים הוא
                    המפתח להצלחה לטווח ארוך.
                  </p>
                </li>
              </ul>
            </div>
            <div>
              <img src={SocialImg} alt="social image" />
            </div>
          </div>
        </div>
        <div className="mt-10">
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl leading-5">
              קידום ממומן בטיק טוק
            </h2>
          </div>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              טיק טוק היא רשת חברתית שמאפשרת לבצע קידום ממומן עם פוטנציאל גבוה
              מאוד, במיוחד עבור חברות שמטרתן להגיע לקהל יעד צעיר יותר.
            </p>
            <p className="mb-[38.4px]">
              כדי לבצע קידום ממומן בטיק טוק כמו שצריך, יש לקחת בחשבון כמה
              נקודות:
            </p>
            <div>
              <ol
                className=" list-decimal"
                style={{ padding: "revert", margin: "revert" }}
              >
                <li>
                  <p>
                    הווידאו הוא המדיום העיקרי – עליך ליצור וידאו מפרסמתי קצר
                    ומעניין שיתאים לקהל היעד שלך. דגש ברור על הווידאו.
                  </p>
                </li>
                <li>
                  <p>
                    סרטונים מחקים – משתמשים רבים של טיק טוק יוצרים סרטונים
                    ‘מחקים’ לסרטונים קיימים, אז אולי זה ישלוט בקמפיין שלך.
                  </p>
                </li>
                <li>
                  <p>
                    סיפור קצר ומשכנע – אל תנסה לספר סיפור ארוך, רקדד את הסיפור
                    והמסרים הכי חשובים בצורה קצרה וברורה.
                  </p>
                </li>
                <li>
                  <p>
                    מטאפורות ושפת רחוב – כדי לדבר אל קהל היעד הקטן של טיק טוק
                    צריך להפעיל שפת רחוב ומטאפורות.
                  </p>
                </li>
                <li>
                  <p>
                    בצע קמפיין סטוריז – הסטוריז בטיק טוק הוכחו כיעילים במיוחד
                    עבור פרסומות, כדאי לנצל אותם.
                  </p>
                </li>
              </ol>
            </div>
            <p className="mb-[38.4px]">
              אני מאחל/ת לך הצלחה ותובנות חכמות במהלך קידום הממומן שלך!
            </p>
          </div>
        </div>
        <div className="mt-10">
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl leading-5">
              פרסום ממומן בטיק טוק: אל תפחד מהקדמה
            </h2>
          </div>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              יש עוד כמה נקודות חשובות לזכור כשמפרסמים בטיק טוק:
            </p>
            <p className="mb-[38.4px]">
              כדי לבצע קידום ממומן בטיק טוק כמו שצריך, יש לקחת בחשבון כמה
              נקודות:
            </p>
            <div>
              <ol
                className=" list-decimal"
                style={{ padding: "revert", margin: "revert" }}
              >
                <li>
                  <p>
                    אל תפחד מהקדמה – לרוב הסרטונים בטיק טוק יש קדמה של כמה
                    שניות, זה חלק מהפורמט. אז אל תחשוב שזה יגרום לאנשים לעזוב
                    באמצע.
                  </p>
                </li>
                <li>
                  <p>
                    תן רמז ב3 השניות הראשונות – תן רמז מהיר מה הסיפור שבסרטון ב3
                    השניות הראשונות, כך שאנשים יחליטו אם הם רוצים להמשיך לצפות.
                  </p>
                </li>
                <li>
                  <p>
                    העבר מסר פשוט וברור – אל תנסה להעביר יותר מדי מידע. רכז
                    בסרטון של 15 שניות רק את המסר החשוב ביותר.
                  </p>
                </li>
                <li>
                  <p>
                    תעביר את המסר באמצעות דיבור ומחיקה – השתמש במחיקות,
                    צ’ורוגרפיה ותנועות גוף כדי לתת למסר שלך עומק נוסף.
                  </p>
                </li>
                <li>
                  <p>
                    כלול קריאה לפעולה – בסוף הסרטון, אל תשכח להזמין את הצופים
                    לבצע פעולה כלשהי, כמו ללחוץ על הקישור בביוגרפיה שלך.
                  </p>
                </li>
                <li>
                  <p>
                    שמור את הקונספט פשוט – המשתמשים בטיק טוק אוהבים סרטונים
                    פשוטים וישירים ללא צורך בהסברים מסובכים. שמור את זה פשוט.
                  </p>
                </li>
                <li>
                  <p>
                    איך מסמנים את הסרטון כפרסומת? שים במקום של הכותרת “#”Ad כדי
                    לסמן את הסרטון כפרסומת.
                  </p>
                </li>
              </ol>
            </div>
            <p className="mb-[38.4px]">
              אני מאמין שהערות אלה יועילו לך בהכנת פרסומת טיק טוק אפקטיבית!
            </p>
          </div>
        </div>

        <div className="mt-10">
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl leading-5">
              הדגשים החשובים ביותר לקידום ממומן אפקטיבי
            </h2>
          </div>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              יש עוד כמה נקודות חשובות לזכור כשמפרסמים בטיק טוק:
            </p>
            <p className="mb-[38.4px]">
              כדי לבצע קידום ממומן בטיק טוק כמו שצריך, יש לקחת בחשבון כמה
              נקודות:
            </p>
            <div>
              <ol
                className=" list-decimal"
                style={{ padding: "revert", margin: "revert" }}
              >
                <li>
                  <p>
                    בחר את קהל היעד הנכון – זה הצעד החשוב ביותר. קהל היעד צריך
                    להיות ספציפי ככל האפשר, הגדרת קבוצות דמוגרפיות ופרמטרים
                    נוספים שיגדירו את קהל היעד המתאים למוצר או השירות שלך.
                  </p>
                </li>
                <li>
                  <p>
                    יצירת תוכן רלוונטי – תוכן הפרסומת צריך להיות מותאם במיוחד
                    לקהל היעד ולתת מענה לצרכים שלהם. תתמקד בתכונותיהם ולא רק
                    במוצר.
                  </p>
                </li>
                <li>
                  <p>
                    מדיה ואסתטיקה מושכות – המדיה והאסתטיקה בפרסומת צריכות להיות
                    מושכות ומותאמות לקהל היעד, כדי שיקפצו עליהן.
                  </p>
                </li>
                <li>
                  <p>
                    אופטימיזציה לחיפושים – הפרסומת צריכה להיות מאופטימית
                    לחיפושים במנועי חיפוש של קהל היעד.
                  </p>
                </li>
                <li>
                  <p>
                    מדידה וניטור – צריך לעקוב אחרי מטריקות כמו קליקים, המרות
                    ומכירות כדי לדעת מה עובד ומה לא.
                  </p>
                </li>
                <li>
                  <p>
                    שינויים ושיפורים -לפי המדדים, לשפר ולשנות את תוכן הפרסומת,
                    המדיה ואסטרטגיות הקידום.
                  </p>
                </li>
                <li>
                  <p>
                    דינאמיות רבה – רשתות חברתיות משנות את אלגוריתמיהן בתדירות
                    גבוהה, מה שמחייב גמישות ושינויים תכופים.
                  </p>
                </li>
              </ol>
            </div>
            <p className="mb-[38.4px]">
              לתמצת, הדבר הכי חשוב הוא קהל היעד הנכון, עליו נבנה כל השאר. מהמצאת
              תוכן מתאים ועד למדידה – הכל צריך להתאים לקהל היעד בצורה הכי טובה.
            </p>
          </div>
        </div>
        <div className=" text-[#7A7A7A]"></div>
      </div>
    </section>
  );
};

export default ContentSection;
