import React from "react";
import FastImg from "../../assets/images/Blue-Yellow-3D-Happy-World-Wide-Web-Instagram-Story-768x1365.png.png";
import ContactForm from "../Portfolio/ContactForm";

const ContentSection: React.FC = () => {
  return (
    <section className="flex flex-col justify-center px-[10px] w-full text-base leading-loose text-right min-h-[490px] text-neutral-700 max-md:px-5 max-md:max-w-full">
      <div className="flex flex-col flex-1 max-w-[1140px] gap-[20px] my-0 mx-auto py-[10px] w-full">
        <div>
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl">
              עיצוב UI/UX
            </h2>
          </div>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              עיצוב ממשק משתמש (UI) ועיצוב חווית משתמש (UX) הם חלק מרכזי בהצלחתו
              של כל מוצר דיגיטלי.
              <br />
              מדוע? כי בסופו של דבר, כל אתר, פורטל או אפליקציה מתוכננים קודם כל
              עבור המשתמשים.
              <br />
              אתם רוצים משתמשים מרוצים שיחזרו למוצר שלכם שוב ושוב? אז אתם חייבים
              להבין אותם, וליצור מוצר שיגרום להם ליהנות מכל רגע.
            </p>
            <p className="mb-[38.4px]">
              את התחום של חווית המשתמש מקובל לדבר דרך שני מושגים, UX ו-UI, בואו
              נבין את ההבדלים ביניהם.
            </p>
          </div>
        </div>
        <div>
          <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl">
            מה ההבדל בין UX ל-UI?
          </h2>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              עיצוב UX מתרכז בשימושיות, ואילו עיצוב UI מתייחס לנראות.
            </p>
            <h4 className=" text-black font-rubik font-semibold">
              עיצוב UI – מה זה?
            </h4>
            <p className="mb-[38.4px] leading-[40px]">
              User Interface או בקיצור UI, הוא כינוי לממשק החשוף לעיניו של
              המשתמש.
              <br />
              עיצוב UI מתמקד בחוויה הגרפית שהמוצר מספק, ומעצב UI הוא זה שיקבע את
              הצבעוניות, הטיפוגרפיה, הניגודיות ושארהאלמנטים העיצוביים.
              <br />
              בניגוד למעצב UX שמתרכז בשימושיות, מעצב UI מתרכז בנראות. הוא ישאף
              ליצור עיצוב מרגש בהתאם לאישיות של המוצר.
              <br />
              לעיתים עיצוב UI ו-UX יסתרו זה את זה. רעיון עיצוב מיוחד, עלול לפגוע
              בשימושיות, או לחלופין, הפיכת המוצרלשימושי יותר עלולה לפגוע בנראות.
              <br />
              בעת תכנון ועיצוב המוצר יהיה צורך להגיע לעמק השווה בין שני אלה. זאת
              אנו עושים בעזרת אנשי המקצוע המומחיםוהמנוסים שלנו בעיצוב UI/UX.
            </p>
            <h4 className=" text-black font-rubik font-semibold">
              עיצוב UX – מה זה?
            </h4>
            <p className="mb-[38.4px]">
              User Experience או בקיצור UX, הוא כינוי לחוויה הכוללת שחווה המשתמש
              בעת שימושו במוצר. למעשה, כשמדברים על UXמתכוונים לתכונות שגורמות
              למוצר להיות שימושי ופשוט להבנה ותפעול.
            </p>
            <p className="mb-[38.4px]">
              מכירים את זה שאתם מורידים אפליקציה מהחנות, נכנסים ומיד מבינים איך
              זה עובד. אז לא, זה לא בגלל שאתם כאלה גאוניםטכנולוגיים – זה בגלל
              שדאגו היטב ל-UX.
            </p>
            <p className="mb-[38.4px]">
              כשאומרים שמוצר מסוים מספק חווית משתמש גבוהה, בעצם מתכוונים
              שהמשתמשים מצליחים לקיים איתו אינטראקציה בקלותוביעילות.
            </p>
            <h4 className=" text-black font-rubik font-semibold">
              איך מייצרים חווית משתמש מעולה? קבלו 3 עקרונות:
            </h4>
            <p className="mb-[38.4px]">
              כל מוצר באשר הוא מוצר, פונה לקהלים שונים. כדי ליצור חווית משתמש
              טובה עליכם להתייחס לכל קהל בכובד ראש.
              <br />
              איך עושים זאת? הגדירו פרסונות שונות להן אתם מייעדים את המוצר.
              חישבו על גיל המשתמשים, על המגדר שלהם, על תחומי העיסוק ועוד. אבל
              בעיקר – נסו לחשוב על צרכי המשתמשים ועל האופן בו המוצר עונה על
              הצרכים האלה.
              <br />
              כך למשל, אם אתם מפתחים אפליקציה שפונה לגילאי 60+, היא חייבת להיות
              מאוד פשוטה לשימוש. בנוסף, היא צריכהלהתבסס על פונטים גדולים.
            </p>
          </div>
        </div>
        <div>
          <h3 className="text-[#1e293b] mb-5 text-[1.625em] font-semibold font-rubik">
            2. אל תניחו הנחות על המשתמשים
          </h3>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <p className="mb-[38.4px]">
            המשתמשים שלכם לא יודעים הכל, ופערי מידע יגרמו לניכור ולנטישה.
            <br />
            דמיינו שיצאתם לבר חדש שחברים המליצו לכם עליו. אתם נכנסים, ואין
            כיסאות. מחפשים את הברמן ולא יודעים שזה בר בשירות עצמי. מתסכל…
            <br />
            אם יש לכם סבלנות, אולי תשקיעו מאמץ, אבל רוב האנשים פשוט יקומו וילכו
            למקום ידידותי יותר. מה יכול לגרום לבר כזה להצליח בכל זאת? מארח
            שיעמוד בכניסה ויסביר לנכנסים איך הדברים עובדים.
            <br />
            כך גם בעיצוב אפליקציה. יכול להיות שחשבתם על רעיון גאוני, אבל אם לא
            הנגשתם אותו בצורה טובה לקהל היעד – הכל יתפספס.
          </p>
        </div>
        <div>
          <h3 className="text-[#1e293b] mb-5 text-[1.625em] font-semibold font-rubik">
            3. תחשבו על הביצועים
          </h3>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <p className=" mb-[38.4px]">
            מעצב טוב נמדד קודם כל בנראות של העיצובים שלו. אבל אם הם לא עולים –
            אף אחד לא יראה אותם.
            <br />
            יכול להיות שיש למעצב רעיון עיצובי אדיר, אבל אם התמונה שהוא יוסיף
            שוקלת המון, הוא עלול לפגוע במהירות של האתר.
            <br />
            מה זה משנה? מהירות האתר חשובה גם למשתמשים, שינטשו אם האתר לא יעלה
            במהירות, וגם לגוגל, שמדרג אתרים איטיים במיקום נמוך יותר.
            <br />
            איך נמנעים מזה? בעיצוב UI/UX צריך לחשוב גם על הנראות וגם על הצד
            הטכני, ולקחת בחשבון שיקולי ביצוע כבר בשלבי התכנון. בנוסף, כדאי לקיים
            תקשורת ישירה בין המעצבים למתכנתים, כדי להשיג ביצועים אידיאליים לאתר.
          </p>
        </div>
        <div>
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl leading-5">
              מי צריך אפיון פרוייקט?
            </h2>
          </div>
        </div>
        <div>
          <h3 className="text-[#1e293b] mb-5 text-[1.625em] font-semibold font-rubik">
            תחשבו על המשתמשים שלכם והם ישארו איתכם
          </h3>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <p className="mb-[25.6px]">
            עיצוב ממשק משתמש ועיצוב חווית משתמש מהווים גורם מרכזי בהצלחת כל
            מוצר. מתן דגש על שני אלה, הוא מה שיתן למוצר שלכם את הערך המוסף. מה
            שיצור את ההבדל היחסי בין המוצר שלכם למתחרים.
            <br />
            אנחנו מתמחים בעיצוב UI/UX מוכוון משתמשים וביצועים. באמצעות תהליך
            מדויק ויצירתי, נפתח מוצר שיגרום למשתמשים שלכם להתמכר. מוכנים להתחיל?
          </p>
        </div>
      </div>
      <div className="flex flex-col flex-1 ">
        <div className="p-[10px] flex flex-col flex-1 ">
          <ContactForm />
        </div>
      </div>
    </section>
  );
};

export default ContentSection;
