import React from "react";
import FastImg from "../../assets/images/Blue-Yellow-3D-Happy-World-Wide-Web-Instagram-Story-768x1365.png.png";

const ContentSection: React.FC = () => {
  return (
    <section className="flex flex-col justify-center px-[10px] w-full text-base leading-loose text-right min-h-[490px] text-neutral-700 max-md:px-5 max-md:max-w-full">
      <div className="flex flex-col flex-1 max-w-[1140px] gap-[20px] my-0 mx-auto py-[10px] w-full">
        <div>
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl">
              האם לבעלי עסקים יש צורך לפרסם באינסטגרם?
            </h2>
          </div>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              כן, לבעלי עסקים קטנים ובינוניים יש היום צורך גדול לנצל את
              הפלטפורמה של אינסטגרם לשיווק וקידום העסק שלהם.
            </p>
            <p className="mb-[38.4px]">
              תוכנות AI יכולות לנתח את תוכן הפוסטים ולהציע שיפורים, לדוגמה על
              ידי הדגשת מילות מפתח רלוונטיות יותר.
            </p>
            <p className="mb-[38.4px]">
              התוכנות יכולות לנטר את הפוסטים הפופולריים והמצליחים של מתחרים או
              קהל יעד ולהציע רעיונות וכיוונים דומים.
            </p>
            <p className="mb-[38.4px]">
              ניתן להגדיר שעות פרסום אופטימליות על פי ניתוחי התוכנות, כך
              שהפוסטים יתפרסמו בזמנים שבהם הם יגיעו למספר מרבי של עוקבים.
            </p>
            <p className="mb-[38.4px]">
              התוכנות יכולות לנהל קמפייני פרסום ממוקדים וממומנים, לפי נתוני
              המשתמשים והעדפותיהם, ולדווח על תוצאותיהם.
            </p>
            <p className="mb-[38.4px]">
              ניתן לנצל את הלמידה האוטומטית של התוכנות על מנת לייעל את התכנים
              והאסטרטגיה הפרסומית ככל שעובר הזמן.
            </p>
          </div>
        </div>
        <div>
          <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl">
            קידום ממומן בשנת 2023 אגדה או מציאות?
          </h2>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              קידום ממומן הוא אחד מהכלים בפרסום באינטרנט שיכולים לעזור לעסקים
              להגדיל את החשיפה והכנסותיהם. בקידום ממומן, אתר האינטרנט של העסק
              מופיע כתוצאה מומנת בחיפוש של גוגל, פייסבוק וכדומה.
            </p>
            <p className="mb-[38.4px]">
              זה עובד באופן הבא:
              <br />
              • אתר האינטרנט של העסק מוגדר כמודעה במנוע החיפוש או בפלטפורמות
              השונות.
              <br />
              • המודעה (ולמעשה הקישור לאתר האינטרנט) מופיעה כתוצאה מומנת –
              פרסומת משולמת.
              <br />• העסק שולם בכל פעם שגולש קישר מהמודעה אל האתר שלו.
            </p>
            <p>
              יתרונות הקידום הממומן:
              <br />
              • אפשר לכוון את המודעות לקהלי היעד הממוקדים ביותר.
              <br />
              • החשיפה גדלה באופן משמעותי.
              <br />
              • יש תשלום רק עבור גולשים שאכן פעלו – מודל של “Pay Per Click”.
              <br />• ניתוחים ונתונים מפורטים לשיפור הכנסות העסק.
            </p>
          </div>
        </div>
        <div>
          <div>
            <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl leading-5">
              פרסום בפייסבוק בשנת 2023
            </h2>
          </div>
        </div>
        <div className=" text-[#7A7A7A]">
          <p className="mb-[25.6px] leading-5">
            בשנת 2023, פרסום בפייסבוק בישראל ישאר כלי חשוב מאוד באסטרטגיות שיווק
            ופרסום עבור עסקים ישראלים. עם זאת, יתרחשו כמה שינויים ומעברים
            חשובים:
          </p>
          <p className="mb-[25.6px] leading-5">
            • התמקדות בסטוריז וסרטונים – פייסבוק תמשיך לדחוף את המעבר לתכנים
            בפורמט של סרטונים וסטוריז, שהפכו לפופולריים במיוחד בשנים האחרונות.
            <br />
            עסקים ישקיעו יותר ביצירת תוכן וידאו וסטוריז אינטראקטיביים.
          </p>
          <p className="mb-[25.6px] leading-5">
            • פרסום ממוקד יותר – פייסבוק תלמד עוד יותר על המשתמשים, ותאפשר פרסום
            ממוקד ברמה אישית תוך שימוש במידע עשיר יותר.
            <br />
            הפרסום יהיה ממוקד יותר בקהלי יעד ספציפיים ואפילו במשתמשים ספציפיים.
          </p>
        </div>
        <div>
          <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl">
            באיזה פלטפורמה הכי כדאי ומשתלם לפרסם תוכן בשנת 2023?
          </h2>
        </div>
        <div className="font-rubik font-normal text-2xl text-[#7A7A7A]">
          <div className=" block">
            <p className="mb-[38.4px]">
              יש מגוון פלטפורמות שאליהן כדאי לפרסם תוכן בשנת 2023, והפלטפורמה
              המתאימה ביותר תלויה בסוג העסק, הקהל היעד והתקציב. עם זאת, יש מספר
              פלטפורמות מרכזיות:
            </p>
            <div>
              <ol
                className=" list-decimal"
                style={{ padding: "revert", margin: "revert" }}
              >
                <li>
                  <p>
                    פייסבוק – פייסבוק עדיין מהווה מנוע צמיחה חשוב עבור עסקים
                    רבים, במיוחד אלה שמכוונים לקהל יעד מעל גיל 25. התוכן העדיף
                    הוא סטוריז וסרטונים.
                  </p>
                </li>
                <li>
                  <p>
                    אינסטגרם – אינסטגרם גדלה מדי שנה והפכה למעשה לרשת החברתית
                    המובילה. אם הקהל היעד שלך הוא צעיר יותר, אינסטגרם עדיפה.
                  </p>
                </li>
                <li>
                  <p>
                    TikTok – אם הקהל שלך הוא בני נוער ובסביבות ה 20-30, אז
                    TikTok היא בחירה חכמה כי זה נהיה המדיום המועדף עליהם בשנים
                    האחרונות.
                  </p>
                </li>
                <li>
                  <p>
                    – אם יש לך תוכן וידאו שאתה רוצה לקדם, אז YouTube היא
                    הפלטפורמה העדיפה. מדובר באתר השלישי הכי גדול בעולם והיא
                    עדיין גדלה.
                  </p>
                </li>
                <li>
                  <p>
                    לינקדאין – לינקדאין ממשיכה להיות פלטפורמת פרסום חשובה לחשיפת
                    המותג וקריאתת גישה ללקוחות פוטנציאליים, במיוחד אם הקהל שלך
                    הוא עסקים.
                  </p>
                </li>
              </ol>
            </div>
          </div>
        </div>
        <div>
          <h2 className=" text-[#F7BA00] font-bold font-rubik text-5xl">
            תשאירו לנו פרטים ואנו בטוחים שנוכל לסייע לכם
          </h2>
        </div>
      </div>
    </section>
  );
};

export default ContentSection;
